am/AdditiveFOAM/tutorials/verificationAndValidation/marangoni/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solid
{
    kappa   (0.1  0.0 0.0);
    Cp      (2090 0.0 0.0);
}

liquid
{
    kappa   (0.1  0.0 0.0);
    Cp      (2090 0.0 0.0);
}

powder
{
    kappa   (0.1  0.0 0.0);
    Cp      (2090 0.0 0.0);
}

//- fluid flow properties
rho     [1 -3 0 0 0 0 0]    760.0;
mu      [1 -1 -1  0 0 0 0]  4.94e-4;
beta    [0 0 0 -1 0 0 0]    1.3e-3;
DAS     [0 1 0 0 0 0 0]     10e-6;
Lf      [0  2 -2  0 0 0 0]  2.1754e5;

// ************************************************************************* //
